n = int(input('Введите свой номер!\n'))

if 1 <= n <= 4:
    k = 1
    print(f'Номер вашего купе: {k}')
if 5 <= n <= 8:
    k = 2
    print(f'Номер вашего купе: {k}')
if 9 <= n <= 12:
    k = 3
    print(f'Номер вашего купе: {k}')
if 13 <= n <= 16:
    k = 4
    print(f'Номер вашего купе: {k}')
if 17 <= n <= 20:
    k = 5
    print(f'Номер вашего купе: {k}')
if 21 <= n <= 24:
    k = 6
    print(f'Номер вашего купе: {k}')
if 25 <= n <= 28:
    k = 7
    print(f'Номер вашего купе: {k}')
if 29 <= n <= 32:
    k = 8
    print(f'Номер вашего купе: {k}')
if 33 <= n <= 36:
    k = 9
    print(f'Номер вашего купе: {k}')

#print(k)

